{
  "backend/main.mo": "Main canister defining clients, interventions, user profiles, access control, and storage mixins with CRUD methods and authorization checks.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty technicalFolder map.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS setup with light/dark theme variables and base styles.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and icons.",
  "frontend/public/sw.js": "Service worker handling caching, fetch interception, and cache cleanup.",
  "frontend/src/App.tsx": "App entry configuring router, authentication state, layout, and service worker registration.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Empty placeholder file for the admin unlock dialog component.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "UI panel to mark or unmark a client as blacklisted, including comments and media upload handling.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "Modal dialog for creating a new client with basic contact and address fields.",
  "frontend/src/components/clients/EditClientDialog.tsx": "Modal dialog for editing an existing client's info, prefilled from the client object.",
  "frontend/src/components/common/AppBadge.tsx": "Wrapper around Badge providing extra visual variants like success, warning, and pending.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard that redirects unauthenticated users and shows a loader during initialization.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Dialog for creating a new intervention with date fields, comments, and media attachments.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog for editing an intervention, preloading date, comments, and media for modification.",
  "frontend/src/components/interventions/InterventionDetailsDialog.tsx": "Dialog showing intervention date, author, comments, media, and optional edit action.",
  "frontend/src/components/interventions/InterventionList.tsx": "Lists interventions with author info, media preview, edit/delete actions, and detail view dialog.",
  "frontend/src/components/layout/MobileLayout.tsx": "Mobile layout with header showing user info, logout button, main content, and footer.",
  "frontend/src/components/media/FilePicker.tsx": "Button-triggered hidden file input for selecting files with optional filters and multiple selection.",
  "frontend/src/components/media/MediaPicker.tsx": "Lets users choose media from camera or gallery, including live camera preview and photo capture.",
  "frontend/src/components/media/MediaPreview.tsx": "Displays a grid of image previews from ExternalBlob URLs.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Shows online/offline status and sync controls with pending count indicator.",
  "frontend/src/components/technical-folder/TechnicalFileRow.tsx": "Displays a technical file row with type icon, metadata, preview, and delete action.",
  "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx": "Dialog for uploading a technical file with name input, picker, progress, and submit handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations to mark or unmark clients as blacklisted, supporting offline queueing and query invalidation.",
  "frontend/src/hooks/useClients.ts": "Implements queries and mutations for fetching, searching, and saving client records with offline support.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and updates the caller's user profile, role, and admin status using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines identity context and provider handling login, logout, and persistent identity via Internet Identity.",
  "frontend/src/hooks/useInterventions.ts": "Provides CRUD-like hooks for client interventions with sorting, offline mode, and permission checks.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events.",
  "frontend/src/hooks/useSync.ts": "Manages syncing of offline operations, auto-triggering sync when online and pending actions exist.",
  "frontend/src/hooks/useTechnicalFolder.ts": "Handles listing, uploading, and deleting technical files through backend actor interactions.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and utility layers.",
  "frontend/src/lib/utils.ts": "Provides a helper to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper creating outbox and cache stores and providing CRUD helpers for offline operations and cached data.",
  "frontend/src/offline/outbox.ts": "Adds offline operations to the outbox store via a simple enqueue wrapper.",
  "frontend/src/offline/syncEngine.ts": "Fetches queued offline operations, runs them against the backend actor, and removes successful or unauthorized ones.",
  "frontend/src/pages/ClientDossierPage.tsx": "Client dossier UI showing client info, interventions, and blacklist status with edit and add dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Client list page with search, technical folder shortcut, and create-client dialog handling.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity and redirecting authenticated users to the clients list.",
  "frontend/src/pages/TechnicalFolderPage.tsx": "Technical file management page enabling listing, uploading, and deleting stored technical files.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs registration results.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings. Defines content paths, custom radii, fonts, and plugins.",
  "project_state.json": "JSON describing the project's state, including existing features, new feature requests, and metadata for implementing a technical folder for file storage. Used to track requirements and development progress."
}