{
  "backend/main.mo": "Main Motoko actor defining client management, interventions, technical folder hierarchy with files/subfolders, user profiles, and access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for file moving functionality: TechnicalFileRow move action, folder selection dialog component, and useMoveFile mutation hook.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing authentication, client management, interventions, offline sync, and technical folder functionality with French translations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, French language setting, noscript fallback, and module script loading for React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, theme colors, and orientation for installable web application in French.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for assets, network-first for navigation, with cache versioning and cleanup on activation.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for login, clients, dossier, technical folder, and dashboard, plus QueryClient, InternetIdentity provider, profile setup dialog, and error boundaries.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Empty file placeholder for admin unlock dialog component.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog forcing new authenticated users to enter their name before continuing, with form validation and save mutation integration.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "Displays and manages client blacklist status with comments and media attachments. Allows marking/unmarking clients as blacklisted with supporting documentation.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "Modal dialog for creating new clients with form fields for name, address, phone, and email. Submits data via useCreateOrUpdateClient hook.",
  "frontend/src/components/clients/EditClientDialog.tsx": "Modal dialog for editing existing client information. Pre-populates form with current client data and updates via useCreateOrUpdateClient hook.",
  "frontend/src/components/common/AppBadge.tsx": "Reusable badge component with custom variants (success, warning, pending) in addition to standard Badge variants. Applies color-coded styling for different states.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a reload button. Shows error message in a styled card layout.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard component that redirects unauthenticated users to home page. Shows loading spinner during authentication check.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Modal dialog for adding new interventions with date, comments, and media attachments. Handles file uploads and converts them to ExternalBlob format.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog component for editing an existing intervention with form fields for date, comments, and media attachments. Uses useUpdateIntervention hook to persist changes and includes MediaPicker/MediaPreview for file handling.",
  "frontend/src/components/interventions/InterventionDetailsDialog.tsx": "Read-only dialog displaying intervention details (date, author, comments, media) with conditional edit button that opens EditInterventionDialog. Fetches author profile and manages dialog state transitions.",
  "frontend/src/components/interventions/InterventionList.tsx": "Main list view for client interventions with add/edit/delete actions and confirmation dialogs. Renders InterventionCard components and manages multiple dialog states for CRUD operations.",
  "frontend/src/components/layout/MobileLayout.tsx": "Mobile-optimized layout wrapper with sticky header, logout/dashboard navigation, connectivity status bar, and footer with caffeine.ai attribution. Manages authentication state and query cache clearing on logout.",
  "frontend/src/components/media/FilePicker.tsx": "Simple file picker button component that programmatically creates and triggers a file input element with configurable accept types and multiple file support.",
  "frontend/src/components/media/MediaPicker.tsx": "Dual-mode media picker with camera capture and gallery selection options. Uses useCamera hook for live camera preview and photo capture in a modal dialog.",
  "frontend/src/components/media/MediaPreview.tsx": "Grid-based preview component that displays ExternalBlob media items as images with error handling for failed loads.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Status bar showing online/offline state and pending sync operations count with manual sync trigger button. Conditionally renders based on connectivity and pending changes.",
  "frontend/src/components/technical-folder/CreateFolderDialog.tsx": "Dialog for creating new folders with name validation (no slashes, non-empty). Shows informational toast that folder creation requires file upload rather than creating empty directories.",
  "frontend/src/components/technical-folder/MoveFolderDialog.tsx": "Dialog component for moving files between folders in the technical folder structure. Builds a navigable folder tree from file paths and allows users to select a destination folder with breadcrumb navigation.",
  "frontend/src/components/technical-folder/TechnicalFileRow.tsx": "Displays a single technical file with preview (PDF, image, video), download functionality, and actions to move or delete the file. Includes confirmation dialogs for destructive operations.",
  "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx": "Dialog component for uploading files to the technical folder with file name input, file picker, and upload progress tracking. Converts selected files to ExternalBlob format before upload.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Handles actor creation with identity, admin token initialization, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file with no content.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations for marking and unmarking clients as blacklisted with comments and media attachments. Invalidates client queries and shows toast notifications on success or error.",
  "frontend/src/hooks/useClients.ts": "Provides queries and mutations for client management including fetching all clients, fetching individual clients, and creating/updating clients. Supports offline operation queueing when network is unavailable.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides queries and mutations for user profile management including fetching the caller's profile, fetching other user profiles by Principal, and saving the caller's profile with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality with configurable options.",
  "frontend/src/hooks/useInterventions.ts": "Provides React Query hooks for managing client interventions (add, update, delete, get) with offline support via operation queuing and online/offline status checks.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/src/hooks/useSync.ts": "Hook that manages offline operation synchronization, tracking pending operation count and automatically syncing when online with an actor available.",
  "frontend/src/hooks/useTechnicalFolder.ts": "React Query hooks for managing technical files including listing, uploading, deleting, and moving files with folder path support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors and safe-area utilities for mobile device insets.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing operations for managing offline operation outbox and cache stores with typed interfaces.",
  "frontend/src/offline/outbox.ts": "IndexedDB-based queue for storing offline operations with functions to enqueue, retrieve, and remove operations by ID.",
  "frontend/src/offline/syncEngine.ts": "Processes queued offline operations by replaying them through the backend actor, handling different operation types and removing completed or unauthorized operations.",
  "frontend/src/pages/ClientDossierPage.tsx": "Client detail page with tabs for interventions, contact information, and blacklist management, including edit functionality for non-blacklisted clients.",
  "frontend/src/pages/ClientsPage.tsx": "Displays a searchable list of clients with a link to the technical folder, allows creating new clients via dialog, and navigates to individual client detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a calendar for date selection and displays interventions scheduled for the selected date, with clickable cards that open intervention details in a dialog.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity authentication UI with loading states and automatic redirect to /clients after successful login.",
  "frontend/src/pages/TechnicalFolderPage.tsx": "Displays a hierarchical file browser for the technical folder with breadcrumb navigation, folder creation, file upload, and folder/file listing capabilities.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for PWA functionality after page load with a 1-second delay to avoid blocking initial render.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom OKLCH color system, container settings, border radius variables, and typography/animation plugins.",
  "project_state.json": "Tracks project state including existing features for file moving functionality and pending feature requests for backend move implementation and UI updates."
}