{
  "backend/main.mo": "Main Motoko actor implementing client management, interventions, user profiles, technical folders, blacklist operations, and media storage with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting deployment of Draft Version 14 to production, listing affected frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, hooks, components, and utilities with French translations and offline support features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "Main HTML entry point with PWA manifest, icons, French locale, viewport configuration, and noscript fallback message.",
  "frontend/public/manifest.webmanifest": "PWA manifest for Vial Traite Service app defining name, icons, theme colors, display mode, and version 14.0.0.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for assets, network-first for navigation, and cache cleanup on activation.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication provider, query client configuration, profile setup dialog, error boundaries, and route definitions for login, clients, dossier, technical folder, and dashboard pages.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Empty file placeholder for admin unlock dialog component.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting authenticated users to enter their name for profile setup with form validation and French labels.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "Displays and manages client blacklist status with comments and media attachments, allowing users to add or remove clients from the blacklist.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "Modal dialog form for creating new clients with required fields (name, address, city, state, zip) and optional phone/email.",
  "frontend/src/components/clients/EditClientDialog.tsx": "Modal dialog form for editing existing client information, pre-populated with current client data.",
  "frontend/src/components/common/AppBadge.tsx": "Reusable badge component with custom variants (success, warning, pending) in addition to standard badge styles.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with retry and reload options.",
  "frontend/src/components/export/ExportDataDialog.tsx": "Modal dialog for exporting application data in JSON or PDF format with progress indicator.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard component that redirects unauthenticated users to home page and shows loading state during authentication check.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Dialog component for adding a new intervention with date fields, comments, and media capture. Handles form submission and converts uploaded files to ExternalBlob format.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog component for editing an existing intervention. Pre-populates form with intervention data and allows updating date, comments, and media.",
  "frontend/src/components/interventions/InterventionDetailsDialog.tsx": "Read-only dialog displaying intervention details including date, author, comments, and media. Conditionally shows edit button if user has edit permissions.",
  "frontend/src/components/interventions/InterventionList.tsx": "Lists all interventions for a client with loading/error states and retry functionality. Manages dialogs for adding, editing, viewing details, and deleting interventions with confirmation.",
  "frontend/src/components/layout/MobileLayout.tsx": "Main mobile layout wrapper with sticky header containing logo and navigation, logout button, connectivity status bar, and footer with attribution. Manages navigation and authentication state.",
  "frontend/src/components/media/FilePicker.tsx": "Simple file picker button component that programmatically creates and triggers a file input element with configurable accept types and multiple file support.",
  "frontend/src/components/media/MediaPicker.tsx": "Media picker with two options: camera capture using device camera with preview dialog, or gallery selection from device storage. Handles camera lifecycle and photo capture.",
  "frontend/src/components/media/MediaPreview.tsx": "Displays a grid of media thumbnails (images) with error handling and optional click-to-view functionality using DocumentViewer. Handles failed image loads with fallback UI.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Shows a status bar indicating online/offline state and pending sync operations count. Provides a sync button when online with pending operations.",
  "frontend/src/components/technical-folder/CreateFolderDialog.tsx": "Dialog for creating new folders with path validation (no slashes allowed). Shows full path preview and handles folder creation via mutation hook.",
  "frontend/src/components/technical-folder/DocumentViewer.tsx": "Full-featured document viewer dialog supporting images, PDFs, and videos with zoom, rotation, fullscreen, pinch-to-zoom, and download capabilities.",
  "frontend/src/components/technical-folder/FileTypeIcon.tsx": "Returns appropriate Lucide icon component based on file extension (images, PDFs, videos, documents, spreadsheets).",
  "frontend/src/components/technical-folder/MoveFolderDialog.tsx": "Dialog for moving files between folders with breadcrumb navigation through folder structure. Prevents moving to current folder and builds folder tree from file paths.",
  "frontend/src/components/technical-folder/RenameFolderDialog.tsx": "Dialog for renaming folders with validation (no slashes, non-empty). Pre-fills current folder name and handles rename via mutation hook.",
  "frontend/src/components/technical-folder/TechnicalFileRow.tsx": "Card component displaying a file with thumbnail preview, view/move/delete actions. Integrates DocumentViewer, MoveFolderDialog, and delete confirmation AlertDialog.",
  "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx": "Dialog component for uploading files to the technical folder with file selection, name input, path display, and upload progress tracking.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity and initializing access control with admin token.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file with no content.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations for marking and unmarking clients as blacklisted with comments and media attachments, invalidating relevant queries on success.",
  "frontend/src/hooks/useClients.ts": "Provides queries and mutations for fetching, creating, and updating clients with offline support via operation queueing and retry logic.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides queries and mutations for fetching and saving user profiles for the current caller or a specific principal.",
  "frontend/src/hooks/useDataExport.ts": "Custom hook for exporting all application data (clients, interventions, technical files) to JSON or text format with progress tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for managing Internet Identity authentication, providing login/logout functionality and identity state management with AuthClient integration.",
  "frontend/src/hooks/useInterventions.ts": "Provides React Query hooks for fetching, adding, updating, and deleting client interventions with offline support via operation queueing and error handling with toast notifications.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/src/hooks/useSync.ts": "Hook that monitors pending offline operations and automatically triggers synchronization when online, providing sync status and manual sync capability.",
  "frontend/src/hooks/useTechnicalFolder.ts": "React Query hooks for managing technical files including listing, uploading, deleting, moving files and creating folders with error handling and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for Vial Traite Service brand colors (blue, green, orange) in light and dark modes, plus safe-area utilities for mobile.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing functions to manage offline operations queue (outbox) and data cache with stores for pending operations and cached data.",
  "frontend/src/offline/outbox.ts": "IndexedDB interface for enqueueing, retrieving, and removing offline operations with timestamp indexing for sync ordering.",
  "frontend/src/offline/syncEngine.ts": "Processes queued offline operations by replaying them through the backend actor, handling various operation types (clients, interventions, blacklist) and removing unauthorized operations from the queue.",
  "frontend/src/pages/ClientDossierPage.tsx": "Displays a client's detailed dossier including their information, interventions list, and blacklist panel. Provides dialogs for editing client info and adding new interventions with error handling and retry logic.",
  "frontend/src/pages/ClientsPage.tsx": "Main clients listing page with search functionality, navigation to technical folder, and buttons to create new clients or export data. Includes loading states, error handling with retry, and filters clients by name.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page with a calendar for date selection and displays interventions scheduled for the selected date. Includes intervention details dialog and error handling with retry functionality.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity authentication that redirects to /clients upon successful authentication. Shows loading states during initialization and login process.",
  "frontend/src/pages/TechnicalFolderPage.tsx": "File browser for technical documents with breadcrumb navigation, folder creation, and file upload capabilities. Organizes files hierarchically and provides folder/file listing with error handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for PWA functionality after page load with a 1-second delay to avoid blocking initial render. Includes error handling and browser compatibility checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to store, retrieve, and clear parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, container settings, border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking a single feature to deploy Draft Version 14 to production, with schema version 1.0.0 and no known issues or architectural notes."
}