{
  "backend/main.mo": "Main backend actor defining clients, interventions, user profiles, and access‑controlled CRUD operations with authorization and blob‑storage mixins.",
  "backend/migration.mo": "No‑op migration module that returns the previous state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files, hooks, and components for build reference.",
  "frontend/index.css": "Tailwind base/theme configuration defining light and dark mode CSS variables and global styles.",
  "frontend/index.html": "Main HTML template configuring PWA metadata, icons, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app name, icons, theme colors, and startup settings.",
  "frontend/public/sw.js": "Service worker implementing basic install, cache, fetch, and activation logic for offline support.",
  "frontend/src/App.tsx": "Main React app entry defining routes, authentication gating, layout, and service worker registration.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Empty placeholder file for an admin unlock dialog component.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to submit their name and saving the profile through backend hooks.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "UI panel to view, add, update, or remove a client’s blacklist status with comments and media uploads.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "Dialog for creating a new client, collecting basic contact and address fields and submitting via a mutation.",
  "frontend/src/components/clients/EditClientDialog.tsx": "Dialog for editing an existing client, preloading current data and sending updates through a mutation.",
  "frontend/src/components/common/AppBadge.tsx": "Wrapper around Badge that adds custom variants like success, warning, and pending with style overrides.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard that redirects unauthenticated users and shows a loading spinner during identity initialization.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Dialog to add an intervention with date, comments, and media, then submit it via a mutation.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog to edit an intervention, preloading existing fields and allowing date, comments, and media updates.",
  "frontend/src/components/interventions/InterventionList.tsx": "Displays a list of interventions with author checks, edit/delete actions, media preview, and loading/empty states.",
  "frontend/src/components/layout/MobileLayout.tsx": "Mobile page layout showing user info, logout button, main content, and footer.",
  "frontend/src/components/media/MediaPicker.tsx": "Provides UI for selecting media from gallery or capturing photos via camera, returning selected files.",
  "frontend/src/components/media/MediaPreview.tsx": "Renders a grid of media thumbnails using direct URLs from ExternalBlob objects.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Shows online/offline status, pending sync count, and a sync button when applicable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations to mark or unmark clients as blacklisted, supporting offline queueing and query invalidation.",
  "frontend/src/hooks/useClients.ts": "Contains queries and mutations for fetching, searching, and creating/updating clients with offline support.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching and saving the current user profile, role, and admin status using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, logout, and status helpers. Handles loading stored identities and creating AuthClient instances.",
  "frontend/src/hooks/useInterventions.ts": "Defines React Query hooks to fetch, add, update, and delete interventions with offline support and status toasts. Uses the actor API and queues operations when offline.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline state and exposes a boolean isOnline value. Listens for window connectivity events.",
  "frontend/src/hooks/useSync.ts": "Manages automatic and manual syncing of queued offline operations. Tracks sync state, pending count, and triggers sync when online.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and utility classes. Includes safe-area padding helpers and base styling.",
  "frontend/src/lib/utils.ts": "Exports a cn function combining clsx and tailwind-merge to merge class names safely.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider. Renders the main App component.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for offline operations and caching. Provides helpers to add, fetch, remove outbox items, and store arbitrary cached data.",
  "frontend/src/offline/outbox.ts": "Adds operations to the offline outbox by wrapping addToOutbox. Simplifies enqueuing offline tasks.",
  "frontend/src/offline/syncEngine.ts": "Synchronizes all queued offline operations by replaying them through an actor. Removes successfully processed items and logs failures.",
  "frontend/src/pages/ClientDossierPage.tsx": "Page displaying a client’s details, interventions, and blacklist info with editing dialogs. Handles loading states and navigation.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, debounced filtering, loading states, and navigation to client details plus a dialog for creating new clients.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login card and triggers Internet Identity login, redirecting authenticated users to the clients page.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs success or failure.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, and layout utilities, and enabling typography, container queries, and animations plugins.",
  "project_state.json": "Project metadata defining access-control rules, blacklist behavior, removed admin role, existing features, and pending feature requests."
}