{
  "backend/main.mo": "Main Motoko actor implementing client management, interventions, technical folder with nested folders/files, user profiles, and access control with authorization mixins and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including logo replacement, brand color palette, document viewer, subfolder organization, drag-and-drop, and associated files/components with test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, hooks, components for authentication, client management, interventions, technical folder, and offline sync functionality with French translations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including primary, secondary, muted, destructive, sidebar, and chart colors.",
  "frontend/index.html": "Main HTML entry point with French locale, PWA manifest, icons, viewport configuration, noscript fallback, and module script loading for React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, theme colors, and orientation for installable progressive web app experience in French.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for assets, network-first for navigation, cache management, and offline support with detailed console logging.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, query client provider, Internet Identity authentication, profile setup dialog, error boundaries, and route definitions for login, clients, dossier, technical folder, and dashboard.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Dialog component for entering admin access code to unlock admin-only features with session-based state management.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component for initial user profile setup that prompts for a name and saves it using the useSaveCallerUserProfile hook. Prevents closing until the profile is saved.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "Card component for managing client blacklist status, allowing users to add/remove clients from blacklist with comments and media attachments. Displays current blacklist status and associated data.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "Dialog form for creating new clients with fields for name, address, phone, and email. Uses useCreateOrUpdateClient hook to persist data.",
  "frontend/src/components/clients/EditClientDialog.tsx": "Dialog form for editing existing client information, pre-populated with current client data. Uses useCreateOrUpdateClient hook to update client details.",
  "frontend/src/components/common/AppBadge.tsx": "Wrapper component around Badge UI component that adds custom variant styles for success, warning, and pending states with appropriate colors.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a reload button. Shows error message in a styled card with AlertCircle icon.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard component that redirects unauthenticated users to home page. Shows loading spinner during authentication check using useInternetIdentity hook.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Dialog form for adding new interventions with date, comments, and media attachments. Uses MediaPicker for file uploads and converts files to ExternalBlob format.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog component for editing an existing intervention with form fields for date, comments, and media attachments. Handles media file uploads by converting them to ExternalBlob format and submits updates via useUpdateIntervention hook.",
  "frontend/src/components/interventions/InterventionDetailsDialog.tsx": "Read-only dialog displaying intervention details including date, author, comments, and media. Conditionally shows an edit button that opens EditInterventionDialog if the user has edit permissions.",
  "frontend/src/components/interventions/InterventionList.tsx": "Main list view component for displaying client interventions with add, edit, and delete actions. Manages multiple dialog states (add, edit, details, delete confirmation) and renders intervention cards that open details on click.",
  "frontend/src/components/layout/MobileLayout.tsx": "Mobile-optimized layout wrapper providing header with logo and navigation, logout functionality, connectivity status bar, main content area, and footer with caffeine.ai attribution. Handles user profile display and dashboard navigation.",
  "frontend/src/components/media/FilePicker.tsx": "Simple file picker button component that programmatically creates and triggers a file input element. Supports configurable file type filtering and single/multiple file selection.",
  "frontend/src/components/media/MediaPicker.tsx": "Media capture component offering two options: camera capture via useCamera hook with live preview dialog, or gallery selection via file input. Handles photo capture and returns selected files to parent component.",
  "frontend/src/components/media/MediaPreview.tsx": "Grid display component for ExternalBlob media items with optional click-to-view functionality. Opens DocumentViewer dialog when clickable mode is enabled and a media item is selected.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Status bar showing online/offline state and pending sync operations count. Displays sync button when online with pending operations, using useOnlineStatus and useSync hooks to manage connectivity and synchronization.",
  "frontend/src/components/technical-folder/CreateFolderDialog.tsx": "Dialog component for creating new folders in the technical folder system with validation to prevent slashes in folder names and path preview.",
  "frontend/src/components/technical-folder/DocumentViewer.tsx": "Modal viewer component for displaying documents (images, PDFs, videos) with zoom, rotation, fullscreen controls, pinch-to-zoom support, and download functionality.",
  "frontend/src/components/technical-folder/FileTypeIcon.tsx": "Utility component that renders appropriate Lucide icons based on file extension (images, PDFs, videos, documents, spreadsheets).",
  "frontend/src/components/technical-folder/MoveFolderDialog.tsx": "Dialog component for moving files between folders with breadcrumb navigation, folder tree browsing, and validation to prevent moving to the current location.",
  "frontend/src/components/technical-folder/RenameFolderDialog.tsx": "Dialog component for renaming folders with validation to prevent slashes in names and checks to avoid renaming to the same name.",
  "frontend/src/components/technical-folder/TechnicalFileRow.tsx": "Card component displaying a file row with thumbnail preview, file name, and action buttons for viewing, moving, and deleting files with confirmation dialogs.",
  "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx": "Dialog component for uploading files to the technical folder with file selection, custom naming, path preview, and upload progress tracking.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file with no content.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations for marking and unmarking clients as blacklisted with comments and media attachments, invalidating relevant queries on success.",
  "frontend/src/hooks/useClients.ts": "Provides queries and mutations for fetching, creating, and updating client records with offline support via operation queueing when network is unavailable.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides queries and mutations for fetching and saving user profiles for both the current caller and other users by Principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity persistence, and delegation management using AuthClient.",
  "frontend/src/hooks/useInterventions.ts": "Provides queries and mutations for managing client interventions (add, update, delete) with offline operation queueing and date/media support.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/src/hooks/useSync.ts": "Manages synchronization of offline operations when online, tracking pending operation count and providing manual sync trigger functionality.",
  "frontend/src/hooks/useTechnicalFolder.ts": "Provides queries and mutations for managing technical files and folders including upload, delete, move, create, and rename operations.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom brand colors for Vial Traite Service (blue, green, orange) and comprehensive light/dark theme variables using OKLCH color space.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/offline/db.ts": "Manages IndexedDB for offline operations with 'outbox' and 'cache' stores, providing functions to add/retrieve/remove operations and cache data.",
  "frontend/src/offline/outbox.ts": "Alternative IndexedDB implementation for offline operations queue with enqueue, retrieve, and remove functions using a separate database instance.",
  "frontend/src/offline/syncEngine.ts": "Synchronizes queued offline operations with the backend by processing each operation type (create/update/delete clients, interventions, blacklist) and removing successfully synced operations.",
  "frontend/src/pages/ClientDossierPage.tsx": "Displays a client's detailed dossier with tabs for interventions, contact information, and blacklist status, including edit functionality for non-blacklisted clients.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients with search functionality, displays a technical folder card, and provides navigation to individual client dossiers with blacklist badges.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a calendar for date selection and displays interventions scheduled for the selected date with clickable cards showing intervention details.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication with loading states, automatically redirecting authenticated users to the clients page.",
  "frontend/src/pages/TechnicalFolderPage.tsx": "Main page component for the technical folder feature with breadcrumb navigation, folder/file listing, upload dialog, create/rename folder dialogs, and hierarchical folder browsing functionality.",
  "frontend/src/pwa/registerServiceWorker.ts": "Service worker registration utility that checks for browser support and registers '/sw.js' after page load with a 1-second delay.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both standard query strings and hash-based routing, with sessionStorage persistence for parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (including Vial brand colors), container settings, border radius variables, and typography/animation plugins.",
  "project_state.json": "Project metadata tracking architectural decisions (React/Motoko stack, Internet Identity auth), implemented features (logo replacement, branding, document viewer, folder management), and pending feature requests for the Vial Traite Service document management application."
}