{
  "backend/main.mo": "Main backend actor implementing client management, interventions, user profiles, technical folder storage, and access control with authorization mixins. Provides CRUD operations for clients, interventions, and file storage with permission checks.",
  "feature_evidence.json": "Feature evidence report documenting five high-confidence features: fixing non-responsive Dossier Client button, restoring intervention access, recovering technical folder data, adding comprehensive error handling, and adding loading indicators throughout the application.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, hooks, components, and utilities with details on authentication, client/intervention management, offline sync, error handling, and French localization.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "Main HTML entry point with PWA manifest, icons, French language setting, viewport configuration for mobile, and noscript fallback message requiring JavaScript.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, display mode (standalone), and orientation (portrait) for the interventions management application.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for assets, network-first for navigation requests, cache management, and offline support with detailed console logging.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, React Query provider, Internet Identity authentication, error boundaries, suspense fallback, profile setup dialog, and routes for login, clients, client dossier, technical folder, and dashboard.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Dialog component for entering admin access code to unlock admin-only features with session-based state management.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog that prompts users to enter their name for profile setup, preventing dismissal until submitted.",
  "frontend/src/components/blacklist/BlacklistPanel.tsx": "Displays and manages client blacklist status with comments and media attachments, allowing users to add or remove clients from the blacklist.",
  "frontend/src/components/clients/CreateClientDialog.tsx": "A form dialog for creating new clients with required fields for name, address, city, state, zip, phone, and email.",
  "frontend/src/components/clients/EditClientDialog.tsx": "A form dialog for editing existing client information, pre-populated with current client data.",
  "frontend/src/components/common/AppBadge.tsx": "A wrapper component around Badge that provides custom variants including success, warning, and pending with themed styling.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a fallback UI with retry and reload options.",
  "frontend/src/components/export/ExportDataDialog.tsx": "Dialog for exporting application data in JSON or PDF format with progress indicator during export.",
  "frontend/src/components/guards/AuthenticatedOnly.tsx": "Route guard component that redirects unauthenticated users to home page and shows loading state during authentication check.",
  "frontend/src/components/interventions/AddInterventionDialog.tsx": "Dialog component for adding a new intervention with date fields, comments, and media capture. Submits intervention data to backend and resets form on success.",
  "frontend/src/components/interventions/EditInterventionDialog.tsx": "Dialog component for editing an existing intervention. Pre-populates form with intervention data and updates the intervention via mutation hook.",
  "frontend/src/components/interventions/InterventionDetailsDialog.tsx": "Read-only dialog displaying intervention details including date, author, comments, and media. Shows edit button if user has edit permissions.",
  "frontend/src/components/interventions/InterventionList.tsx": "Lists all interventions for a client with loading/error states, retry functionality, and action buttons for add/edit/delete. Includes confirmation dialog for deletions.",
  "frontend/src/components/layout/MobileLayout.tsx": "Main mobile layout wrapper with header (logo, dashboard button, logout), connectivity status bar, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/media/FilePicker.tsx": "Simple file picker button component that programmatically creates and triggers a file input element with configurable accept types and multiple file support.",
  "frontend/src/components/media/MediaPicker.tsx": "Media picker with two options: camera capture (opens dialog with live video feed) or gallery selection (file input). Uses custom useCamera hook for camera functionality.",
  "frontend/src/components/media/MediaPreview.tsx": "Displays a grid of media thumbnails from ExternalBlob objects with optional click-to-view functionality that opens a DocumentViewer dialog.",
  "frontend/src/components/sync/ConnectivityStatusBar.tsx": "Shows a status bar indicating online/offline state and pending sync operations count, with a manual sync button when online and operations are pending.",
  "frontend/src/components/technical-folder/CreateFolderDialog.tsx": "Dialog component for creating new folders in the technical folder system, validates folder names (no slashes) and constructs full paths based on current location.",
  "frontend/src/components/technical-folder/DocumentViewer.tsx": "Full-featured document viewer dialog supporting images, PDFs, and videos with zoom, rotation, fullscreen, pinch-to-zoom, and download capabilities.",
  "frontend/src/components/technical-folder/FileTypeIcon.tsx": "Returns appropriate Lucide icon component based on file extension (images, PDFs, videos, documents, spreadsheets, or generic file).",
  "frontend/src/components/technical-folder/MoveFolderDialog.tsx": "Dialog for moving files between folders with breadcrumb navigation, folder tree browsing, and validation to prevent moving to the current location.",
  "frontend/src/components/technical-folder/RenameFolderDialog.tsx": "Dialog for renaming folders with validation to prevent slashes in names and checks against unchanged names before submitting.",
  "frontend/src/components/technical-folder/TechnicalFileRow.tsx": "Card component displaying a technical file with thumbnail preview, view/move/delete actions, and confirmation dialogs for destructive operations.",
  "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx": "Dialog component for uploading files to the technical folder with file selection, name input, path display, and upload progress tracking.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin token.",
  "frontend/src/hooks/useAdminUnlock.ts": "Empty file with no content.",
  "frontend/src/hooks/useBlacklist.ts": "Provides mutations for marking and unmarking clients as blacklisted with comments and media attachments, invalidating relevant queries on success.",
  "frontend/src/hooks/useClients.ts": "Hooks for fetching client lists and individual clients, plus creating/updating clients with offline operation queueing support when network is unavailable.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides queries and mutations for fetching and saving user profiles, including the current caller's profile and other users' profiles by Principal.",
  "frontend/src/hooks/useDataExport.ts": "Hook for exporting all application data (clients, interventions, technical files) to JSON or text format with progress tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useInterventions.ts": "Provides React Query hooks for managing interventions (add, update, delete, get by client) with offline support via operation queueing and error handling with toast notifications.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/src/hooks/useSync.ts": "Hook that monitors pending offline operations and automatically triggers synchronization when online, exposing sync status and manual sync trigger.",
  "frontend/src/hooks/useTechnicalFolder.ts": "React Query hooks for managing technical files including list, upload, delete, move operations and folder creation with error handling and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for Vial Traite Service brand colors (blue, green, orange) in light and dark modes, plus safe-area utilities for mobile.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing operations for offline data storage with 'outbox' store for pending operations and 'cache' store for cached data.",
  "frontend/src/offline/outbox.ts": "IndexedDB interface for managing offline operation queue with enqueue, retrieve, and remove functions using a dedicated operations store.",
  "frontend/src/offline/syncEngine.ts": "Synchronization engine that processes queued offline operations (client updates, interventions, blacklist changes) by replaying them through the backend actor and removing completed operations.",
  "frontend/src/pages/ClientDossierPage.tsx": "Displays a detailed client dossier page with tabs for interventions and blacklist management, including edit functionality and error handling with retry logic.",
  "frontend/src/pages/ClientsPage.tsx": "Main clients list page with search functionality, navigation to technical folder, client creation dialog, and data export capabilities.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page with calendar date picker that displays interventions for the selected date, with detailed intervention view dialog.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity authentication that redirects to /clients upon successful authentication.",
  "frontend/src/pages/TechnicalFolderPage.tsx": "Technical folder file browser with breadcrumb navigation, folder creation/renaming, file upload, and hierarchical folder structure display.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for PWA functionality with delayed registration to avoid blocking initial render.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space, container settings, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting critical bugs (non-responsive Dossier Client button, data loss in technical folders) and planned fixes including error handling, loading indicators, retry logic, and data export functionality for a service management application using Internet Identity authentication."
}