{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable moving uploaded files between technical folders",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a 'Move' action to each file in the TechnicalFileRow component that opens a folder selection dialog",
      "acceptanceCriteria": [
        "TechnicalFileRow displays a 'Move' button or menu item alongside existing download and delete actions",
        "Clicking 'Move' opens a dialog showing available destination folders",
        "Dialog excludes the current folder from destination options"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/technical-folder/TechnicalFileRow.tsx",
          "operation": "modify",
          "description": "Add a 'Move' button to the file actions row alongside the existing download and delete buttons. When clicked, this button opens the folder selection dialog component (MoveFolderDialog). Pass the current file path and a callback to handle the move operation. Use the authorization component to verify the user has permission to move files before showing the button."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create a folder selection dialog component that displays the technical folder hierarchy and allows selecting a destination folder",
      "acceptanceCriteria": [
        "Dialog shows all existing folders in the technical folder structure",
        "User can navigate through nested folders",
        "User can select a destination folder and confirm the move operation",
        "Dialog includes a cancel option"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/technical-folder/MoveFolderDialog.tsx",
          "operation": "create",
          "description": "Create a new dialog component that displays the technical folder hierarchy in a navigable tree structure. Use the listTechnicalFiles backend method (via useTechnicalFolder hook) to retrieve all file paths and derive the folder structure from them. Allow users to select a destination folder, excluding the current folder of the file being moved. Include confirm and cancel buttons. Accept props for the current file path, onConfirm callback (receiving the selected destination path), and onCancel callback. Use shadcn/ui Dialog, ScrollArea, and Button components for consistent styling."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create useMoveFile React Query mutation hook that calls the backend move function and invalidates technical folder queries on success",
      "acceptanceCriteria": [
        "Hook accepts source path, destination path, and client ID",
        "On success, invalidates technical folder queries to refresh the file list",
        "Shows success toast notification when file is moved",
        "Shows error toast notification if move operation fails",
        "Follows the same pattern as existing useTechnicalFolder hooks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTechnicalFolder.ts",
          "operation": "modify",
          "description": "Add a new useMoveFile mutation hook that calls the backend moveTechnicalFile method with oldPath and newPath parameters. On success, invalidate the 'technicalFiles' query key to refresh the file list and show a success toast notification. On error, show an error toast notification. Follow the same pattern as the existing useDeleteTechnicalFile hook. Use the authorization component's access control to ensure users have appropriate permissions before allowing the move operation."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update TechnicalFolderPage to refresh the file list after a successful move operation",
      "acceptanceCriteria": [
        "File list automatically updates when a file is moved",
        "Moved file no longer appears in the source folder",
        "User remains on the current folder view after move operation",
        "Loading state is shown during the move operation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TechnicalFolderPage.tsx",
          "operation": "modify",
          "description": "Integrate the MoveFolderDialog component into the page. When the move operation completes successfully (via the useMoveFile hook), the file list will automatically refresh due to query invalidation. Ensure the user remains on the current folder path after the move operation. Display a loading state while the move operation is in progress. Use the authorization component to verify the user has permission to move files before showing the move functionality."
        }
      ]
    }
  ]
}