{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Technical Folder (global file storage) — frontend dashboard UI",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add an authenticated dashboard route and navigation entry for the Technical Folder page.",
      "acceptanceCriteria": [
        "A new route is registered in frontend/src/App.tsx for the Technical Folder page (e.g., /technical-folder).",
        "The Technical Folder page is guarded by the existing AuthenticatedOnly component.",
        "The main dashboard page (frontend/src/pages/ClientsPage.tsx) includes a visible, user-friendly control (button/card) that navigates to the Technical Folder page.",
        "All user-facing text introduced for this feature is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TechnicalFolderPage.tsx",
          "operation": "create",
          "description": "Create the Technical Folder dashboard page component (route target) and wrap its content with AuthenticatedOnly to ensure only authenticated users can access it. Ensure all new UI text is English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new /technical-folder route in the TanStack Router tree and wire it to TechnicalFolderPage so it is navigable."
        },
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Add a prominent navigation control (e.g., card/button near the top) labeled in English (e.g., \"Technical Folder\") that routes users to /technical-folder."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement Technical Folder UI to upload, preview, list, and delete PDF/image/video files with proper loading/empty states.",
      "acceptanceCriteria": [
        "The Technical Folder page provides an upload flow that accepts PDF, image, and video files.",
        "After upload, newly added items appear in the list without a full page refresh (React Query cache invalidation/refetch).",
        "The list renders each item with filename and uploaded date/time; images render as thumbnails, videos render with a playable preview, and PDFs render as a downloadable/openable link using the blob direct URL.",
        "Users can delete items they are allowed to delete, and the UI updates accordingly after deletion.",
        "Empty state and loading state are implemented (consistent with the existing Cards/Skeleton usage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TechnicalFolderPage.tsx",
          "operation": "modify",
          "description": "Implement the Technical Folder page UI: upload control (PDF/image/video), list rendering with previews (image thumbnail, video player preview, PDF open/download link via ExternalBlob direct URL), delete action per item, and loading/empty states using existing Card/Skeleton components. Use React Query invalidation/refetch so the list updates after upload/delete without a full refresh. Use the blob-storage ExternalBlob direct URL capability for previews and links. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/technical-folder/TechnicalFileRow.tsx",
          "operation": "create",
          "description": "Create a presentational row/card component to render a single technical-folder item (filename, uploaded date/time, preview based on mimeType, and delete action). Use blob-storage ExternalBlob.getDirectURL() for preview/link rendering. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx",
          "operation": "create",
          "description": "Create an upload card component used by TechnicalFolderPage to select a file (PDF/image/video), show basic upload progress/state, and trigger the upload mutation; keep all labels in English."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a reusable file picker that supports PDFs in addition to image/video without impacting existing media flows.",
      "acceptanceCriteria": [
        "The Technical Folder upload flow can select PDFs via the browser file picker (accept includes application/pdf).",
        "Existing intervention and blacklist media selection continues to work as before (image/video selection is unchanged).",
        "Any new/updated UI labels in the picker components are in English (do not introduce new French labels)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/media/FilePicker.tsx",
          "operation": "create",
          "description": "Add a new file picker component dedicated for selecting files (configurable accept + single/multiple) that supports PDFs (application/pdf) in addition to image/video. Keep all labels English. Use this new component for the Technical Folder so existing MediaPicker-based intervention/blacklist flows remain unchanged."
        },
        {
          "path": "frontend/src/components/technical-folder/TechnicalFolderUploadCard.tsx",
          "operation": "modify",
          "description": "Wire the new FilePicker component into the Technical Folder upload UI with accept set to include application/pdf alongside image/* and video/*."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add React Query hooks for Technical Folder list/upload/delete using the existing actor pattern and consistent toast error handling.",
      "acceptanceCriteria": [
        "A dedicated hook module exists (e.g., useTechnicalFolder*) that exposes at least: useGetTechnicalFiles, useAddTechnicalFile, useDeleteTechnicalFile.",
        "Hooks use the existing actor access pattern (useActor) and invalidate relevant queries on success.",
        "Errors such as Unauthorized are surfaced via existing toast patterns (sonner) with clear English messaging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTechnicalFolder.ts",
          "operation": "create",
          "description": "Create React Query hooks: useGetTechnicalFiles, useAddTechnicalFile, useDeleteTechnicalFile. Use the existing useActor access pattern and invalidate the Technical Folder query key on successful upload/delete so UI refreshes automatically. Use sonner to surface Unauthorized and generic errors with clear English messages. Use the blob-storage ExternalBlob class when constructing uploads and when rendering using direct URLs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TechnicalFolderPage.tsx",
          "operation": "modify",
          "description": "Use the new useTechnicalFolder hooks to fetch, upload, and delete technical files; ensure mutations trigger query invalidation/refetch and errors are shown via toast."
        }
      ]
    }
  ]
}